////////////////////////////////////////////////////////
//
// 문제 005
//
// join, split 함수를 이용하여 
// 각각의 문제에 맞게 정해진 출력값이 나오도록 하세요.
//
////////////////////////////////////////////////////////

// join
// 배열 -> 문자열로 만듭니다.
// 인자로 각 배열 요소의 연결자를 전달할 수 있습니다.
// [1, 2, 3].join(",") -> "1,2,3"
// [1, 2, 3].join("") -> "123"


// split
// 문자열 -> 배열로 만듭니다
// 인자로 분리 기준을 전달할 수 있습니다.
// "1, 2, 3".split(",") -> ["1", " 2", " 3"]
// "1, 2, 3".split(", ") -> ["1", "2", "3"]
// "monster".split("") -> ["m", "o", "n", "s", "t", "e", "r"]



// 문제 1. 목표 출력값: "2024-11-24"
const question1 = ["2024", "11", "24"]


// 문제 2. 목표 출력값: "2024-11-24 12:30:17"
const question2Date = ["2024", "11", "24"]
const question2Time = ["12", "30", "17"]


// 문제 3. 목표 출력값: ["인호", "주은", "시온"]
const question3 = "인호 : 주은 : 시온"


// 문제 4. 
// 목표 출력값
// ["id", "123"]
// ["category", "shoes"]
const question4 = "https://example.com/products?id=123&category=shoes"


// 문제 5. 목표 출력값: "m o n s t e r"
const question5 = "monster"


// 문제 6. 목표 출력값: "인호 / 주은"
const question6 = "이름: 인호, 이름: 주은"

