////////////////////////////////////////////////////////
//
// 문제 107
//
// 1월 1일의 요일은 firstDay로 주어진다. 1월은 31일까지 있다.
// 0: 월요일, 1: 화요일, 2: 수요일, 3: 목요일, 4: 금요일, 5: 토요일, 6: 일요일
// 1월의 모든 일자와 요일을 오름차순으로 작성하라
// 형식은 목표 출력값을 참고한다.
//
////////////////////////////////////////////////////////

const firstDay = 3; // 목요일

// 작성 영역 /////////////////////////////////////////////



////////////////////////////////////////////////////////


// 목표 출력값: firstDay가 0인 경우
// 1월 1일 - 월요일
// 1월 2일 - 화요일
// 1월 3일 - 수요일
// 1월 4일 - 목요일
// 1월 5일 - 금요일
// 1월 6일 - 토요일
// 1월 7일 - 일요일
// 1월 8일 - 월요일
// 1월 9일 - 화요일
// ...
// 1월 29일 - 월요일
// 1월 30일 - 화요일
// 1월 31일 - 수요일


// 목표 출력값: firstDay가 3인 경우
// 1월 1일 - 목요일
// 1월 2일 - 금요일
// 1월 3일 - 토요일
// 1월 4일 - 일요일
// 1월 5일 - 월요일
// 1월 6일 - 화요일
// 1월 7일 - 수요일
// 1월 8일 - 목요일
// 1월 9일 - 금요일
// ...
// 1월 29일 - 목요일
// 1월 30일 - 금요일
// 1월 31일 - 토요일

