////////////////////////////////////////////////////////
//
// 문제 109
//
// 작성 영역에 코드를 작성해서 정해진 출력값이 나오도록 하세요.
//
// 평점 grade가 주어지고, 해당 grade에 맞는 별을 배열에 삽입합니다.
// 평점은 자연수이고, 0 이상, 5이하입니다.
// 왼쪽부터 별을 채워 나가며, 별이 모두 채워진 경우 "full", 빈 별일 경우 "empty"를 삽입합니다.
// 항상 5개의 별을 넣어야 합니다. 채워지지 않는 별은 모두 empty로 처리합니다.
//
////////////////////////////////////////////////////////

const grade = 5;
let stars = []

// 작성 영역 /////////////////////////////////////////////



////////////////////////////////////////////////////////

console.log(stars)

// 목표 출력값: grade = 3인 경우
// ["full", "full", "full", "empty", "empty"]

// 목표 출력값: grade = 0인 경우
// ["empty", "empty", "empty", "empty", "empty"]

// 목표 출력값: grade = 5인 경우
// ["full", "full", "full", "full", "full"]
